In [1]:
import csv

# Open file in write mode
with open("sample_people.csv", "w", newline="") as file:
    writer = csv.writer(file)
    
    # Write header
    #writer.writerow(["First Name", "Last Name", "City"])
    
    # Write rows
    writer.writerow(["", "", ""])
    writer.writerow(["Sabrina", "Lewis", "Matthewview"])
    writer.writerow(["Molly", "Conner", "Brentview"])
    writer.writerow(["Angela", "Webb", "Smithberg"])
    writer.writerow(["Brenda", "Ferguson", "Choiport"])
    writer.writerow(["Patrick", "Wright", "Lake Michele"])
    writer.writerow(["Richard", "Mitchell", "North Danielmouth"])
    writer.writerow(["Kevin", "Alexander", "Port Colinburgh"])
    writer.writerow(["Zachary", "Foster", "Mallorystad"])
    writer.writerow(["Brandon", "Hale", "East Martin"])
    writer.writerow(["Lori", "Hays", "New Joelshire"])

print("CSV file created successfully!")

CSV file created successfully!

In [2]:
import pandas as pd

# Read the CSV
df = pd.read_csv("sample_people.csv")

# Rename headers explicitly
df.columns = ["First Name", "Last Name", "City"]

print(df)

# Check the Shape
df.shape

  First Name  Last Name               City
0    Sabrina      Lewis        Matthewview
1      Molly     Conner          Brentview
2     Angela       Webb          Smithberg
3     Brenda   Ferguson           Choiport
4    Patrick     Wright       Lake Michele
5    Richard   Mitchell  North Danielmouth
6      Kevin  Alexander    Port Colinburgh
7    Zachary     Foster        Mallorystad
8    Brandon       Hale        East Martin
9       Lori       Hays      New Joelshire

(10, 3)

In [65]:
df.head()

  First Name Last Name          City
0    Sabrina     Lewis   Matthewview
1      Molly    Conner     Brentview
2     Angela      Webb     Smithberg
3     Brenda  Ferguson      Choiport
4    Patrick    Wright  Lake Michele

In [66]:
df.tail()

  First Name  Last Name               City
5    Richard   Mitchell  North Danielmouth
6      Kevin  Alexander    Port Colinburgh
7    Zachary     Foster        Mallorystad
8    Brandon       Hale        East Martin
9       Lori       Hays      New Joelshire

In [3]:
import pandas as pd

# Read CSV but skip the first 2 rows
#df = pd.read_csv("sample_people.csv", skiprows=2, header=0)
df = pd.read_csv("sample_people.csv",header=0, skiprows= range(1,3))
#df = pd.read_csv("sample_people.csv", skiprows= range(1,3))
#df = pd.read_csv("sample_people.csv", header=2)
# Rename headers explicitly
df.columns = ["First Name", "Last Name", "City"]

print(df)

  First Name  Last Name               City
0     Angela       Webb          Smithberg
1     Brenda   Ferguson           Choiport
2    Patrick     Wright       Lake Michele
3    Richard   Mitchell  North Danielmouth
4      Kevin  Alexander    Port Colinburgh
5    Zachary     Foster        Mallorystad
6    Brandon       Hale        East Martin
7       Lori       Hays      New Joelshire

In [10]:
print("Range of Rows and Columns:\n", df.loc[1:3, ['First Name', 'City']], "\n")

Range of Rows and Columns:
   First Name       City
1      Molly  Brentview
2     Angela  Smithberg
3     Brenda   Choiport

In [60]:
df.shape

(8, 3)

In [4]:
df_dropped = df.drop(columns=['City'])
print(df_dropped, "\n")

  First Name  Last Name
0     Angela       Webb
1     Brenda   Ferguson
2    Patrick     Wright
3    Richard   Mitchell
4      Kevin  Alexander
5    Zachary     Foster
6    Brandon       Hale
7       Lori       Hays

In [6]:
with open("sample_people.csv", "w", newline="") as file:
    writer = csv.writer(file)
    
    # Write header
    #writer.writerow(["First Name", "Last Name", "City"])
    
    # Write rows
    writer.writerow(["", "", ""])
    writer.writerow(["Sabrina", "Lewis", "None"])
    writer.writerow(["Molly", "Conner", "Brentview"])
    writer.writerow(["Angela", "Webb", "Smithberg"])
    writer.writerow(["Brenda", "Ferguson", "Choiport"])
    writer.writerow(["Patrick", "Wright", "Lake Michele"])
    writer.writerow(["Richard", "Mitchell", "North Danielmouth"])
    writer.writerow(["Kevin", "Alexander", "Port Colinburgh"])
    writer.writerow(["Zachary", "Foster", "Mallorystad"])
    writer.writerow(["Brandon", "Hale", "East Martin"])
    writer.writerow(["Lori", "Hays", "New Joelshire"])

In [7]:
import pandas as pd

df = pd.read_csv("sample_people.csv")
df.columns = ["First Name", "Last Name", "City"]

# Add a new column "Age"
df["Age"] = [23, 25, 22, 28, 21, 26, 24, 27, 29, 30]
print(df)

  First Name Last Name               City  Age
0    Sabrina     Lewis                NaN   23
1      Molly    Conner          Brentview   25
2     Angela      Webb          Smithberg   22
3     Brenda  Ferguson           Choiport   28
4    Patrick       NaN       Lake Michele   21
5    Richard  Mitchell  North Danielmouth   26
6      Kevin       NaN    Port Colinburgh   24
7    Zachary       NaN        Mallorystad   27
8    Brandon      Hale        East Martin   29
9       Lori      Hays      New Joelshire   30

In [8]:
df_dropna = df.dropna()
print( df_dropna, "\n")

  First Name Last Name               City  Age
1      Molly    Conner          Brentview   25
2     Angela      Webb          Smithberg   22
3     Brenda  Ferguson           Choiport   28
5    Richard  Mitchell  North Danielmouth   26
8    Brandon      Hale        East Martin   29
9       Lori      Hays      New Joelshire   30

In [17]:
data = {
    'Name': ['Amit', 'Priya', 'Rohan', 'Sneha', None],
    'Age': [23, 25, None, 22, 24],
    'City': ['Delhi', None, 'Mumbai', 'Pune', 'Chennai'],
    'Marks': [85, 90, 78, None, 88]
}
df = pd.DataFrame(data)
df_fillna = df.fillna({
    'Name': 'Unknown',
    'Age': df['Age'].mean(),
    'City': 'Not Specified',
    'Marks': df['Marks'].mean()
    })
print(df_fillna)

      Name   Age           City  Marks
0     Amit  23.0          Delhi  85.00
1    Priya  25.0  Not Specified  90.00
2    Rohan  23.5         Mumbai  78.00
3    Sneha  22.0           Pune  85.25
4  Unknown  24.0        Chennai  88.00

In [9]:
# Add new row using loc
df.loc[len(df)] = ["Jack", "Nelson", "Chicago", 24]
print(df)

   First Name  Last Name               City  Age
0     Sabrina      Lewis        Matthewview   23
1       Molly     Conner          Brentview   25
2      Angela       Webb          Smithberg   22
3      Brenda   Ferguson           Choiport   28
4     Patrick     Wright       Lake Michele   21
5     Richard   Mitchell  North Danielmouth   26
6       Kevin  Alexander    Port Colinburgh   24
7     Zachary     Foster        Mallorystad   27
8     Brandon       Hale        East Martin   29
9        Lori       Hays      New Joelshire   30
12       Jack     Nelson            Chicago   24